# Homebrew Bundle, list of all brew/cask apps
# run ./brew.sh or "brew bundle --describe"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "azure/functions"
tap "homebrew/cask-fonts"
tap "teamookla/speedtest"
brew "speedtest"
brew "git"                                  # Dev tool
brew "git-extras"                           # Extra git commands for productivity / reporting
brew "gnu-sed"                              # Dev tool (req)
brew "graphviz"                             # Lib to visualize data
brew "heroku/brew/heroku"                   # Heroku CLI
brew "mas"                                  # Mac App store app to download existing apps
brew "mitmproxy"                            # Free proxy for analyzing web traffic (like Fiddler)
brew "nmap"                                 # Network utility
brew "node", link: false                    # Nodejs language tools
brew "npm"                                  # Node Package Manager
brew "nvm"                                  # Node Version Manager
brew "pandoc"                               # File format converter
brew "python3"                              # Python 3 including pip3
brew "pyenv"
brew "shpotify"                             # CLI for Spotify on Mac
brew "tldr"                                 # simple, community-drive man pages
brew "tree"                                 # Tree visualization for directories
brew "typescript"                           # Typescript language tools
brew "yarn"                                 # JS/Node package
brew "yarn-completion"                      # Statement completion for Yarn
brew "wget"                                 # File download
brew "youtube-dl"                           # CLI to download Youtube videos
brew "zsh"                                  # ZSH
brew "utf8proc"
brew "zsh-syntax-highlighting"              # ZSH syntax highlighting
brew "zsh-autosuggestions"                  # ZSH suggestions
cask "firefox"                              # Firefox browser
cask "autopkgr"                             # Autopkgr
cask "disk-inventory-x"                     # Check what's taking up space on your Mac
cask "profilecreator"                       # Create macOS Configuration Profiles
cask "google-chrome"                        # Chrome browser
cask "mactracker"
cask "fsmonitor"                            # Check the filesystem
cask "keepingyouawake"                      # Keeps MacOS from going to sleep indefinitely
cask "iterm2"                               # Terminal Window app
cask "microsoft-office"                     # Microsoft Office
cask "keka"                                 # Archive utility
cask "powershell"                           # PowerShell CLI
cask "mysqlworkbench"                       # MySQL Workbench
cask "packages"                             # Create custom packages
cask "slack"                                # Slack client
cask "appcleaner"  
cask "spotify"                              # Music service
cask "suspicious-package"                   # Inspect Mac app packages before installing
cask "iina"                                 # Play-everything media player
mas "", id: 441258766                       # Install Magnet
mas "", id: 1514817810                      # PoolSide FM
mas "", id: 425264550                       # BlackMagic Disk Speed
mas "", id: 409183694                       # Keynote
mas "", id: 409201541                       # Pages
mas "", id: 1385985095                      # uBlock
